<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"11cd41316c6324598d75aad00b571035c1a8f690e662071c28cdf02e58db9e91","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #884 at https://github.com/cal-itp/data-infra/actions/runs/18897596744","plan_out_hash":"6752dd79d2bb2c18776490856a8e9492478e20e0669f2b3c01013d836bb1d60b","plan_hash":"e5fd2d8014631d0fe3eb6fee73bd7316ac931a32829e2c3f63b43048ded2f125","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 4 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/dags.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "tQl0DA==" -> (known after apply)
!~      detect_md5hash      = "B95K3uhC41c6uMX4cvS/GA==" -> "different hash"
!~      generation          = 1757464207493746 -> (known after apply)
        id                  = "calitp-composer-dags/dags.py"
!~      md5hash             = "B95K3uhC41c6uMX4cvS/GA==" -> (known after apply)
        name                = "dags/dags.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/download_gtfs_schedule_v2/_email_download_failures.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "W7LJjA==" -> (known after apply)
!~      detect_md5hash      = "iRJ0PWcukGt+i1vBoZ/mmg==" -> "different hash"
!~      generation          = 1760041506297314 -> (known after apply)
        id                  = "calitp-composer-dags/download_gtfs_schedule_v2/_email_download_failures.py"
!~      md5hash             = "iRJ0PWcukGt+i1vBoZ/mmg==" -> (known after apply)
        name                = "dags/download_gtfs_schedule_v2/_email_download_failures.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "HFLpFA==" -> (known after apply)
!~      detect_md5hash      = "AxlvqGlF0XQytL7X6uBrow==" -> "different hash"
!~      generation          = 1761674676592506 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "AxlvqGlF0XQytL7X6uBrow==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "JvfK6A==" -> (known after apply)
!~      detect_md5hash      = "/ncG1pOau+Ob3onRgEJBiQ==" -> "different hash"
!~      generation          = 1761674678163486 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "/ncG1pOau+Ob3onRgEJBiQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 4 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #884](https://github.com/cal-itp/data-infra/actions/runs/18897596744)